Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/before_you_come_to_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Before you come to Ireland
ga: Sula dtagann tú go hÉirinn

source: There are many reasons why you may be coming to Ireland
ga: Is iomaí cúis a d'fhéadfadh a bheith agat le teacht go hÉirinn

source: You may be coming to work, to set up a business, to study, to join a family member or to retire
ga: B'fhéidir go bhfuil tú ag teacht le dul ag obair, le gnólacht a bhunú, le bheith in éineacht le duine muinteartha nó le dul ar scor

source: You may be looking for international protection and intend to apply for refugee status or subsidiary protection
ga: B'fhéidir go bhfuil tú ag lorg cosanta agus go bhfuil sé i gceist agat cur isteach ar stádas dídeanaithe nó ar chosaint eile

source: Before you come to Ireland, you need to know first of all whether or not you are entitled to live here
ga: Sula dtiocfaidh tú go hÉirinn, ní mór duit a fháil amach an bhfuil tú i dteideal cónaí anseo nó nach bhfuil

source: Your right to live in Ireland depends mainly on your nationality and what you intend to do when you come here
ga: Braitheann do cheart cónaithe in Éirinn go príomha ar do náisiúntacht agus ar a bhfuil sé i gceist agat a dhéanamh nuair a thagann tú anseo

source: After you have established whether or not you are entitled to come and live in Ireland, you will need other information about the formalities of living here
ga: Tar éis duit a dhearbhú an bhfuil sé de chead agat teacht chun cónaí in Éirinn nó nach bhfuil, beidh eolas eile ag teastáil uait maidir leis na gnásanna a bhaineann le cónaí anseo

source: This document is an overview of the main things you need to know if you are proposing to come to Ireland to live
ga: Is forbhreathnú é an doiciméad seo ar na príomhnithe le bheith ar eolas agat má tá sé i gceist agat cur fút in Éirinn

source: (It is not designed for short term visitors, but you may find some relevant information below.)
ga: (Níl sé dírithe ar chuairteoirí gearrthréimhseacha, ach d'fhéadfá roinnt eolais ábhartha a aimsiú thíos.)

source: Coming to Ireland and permission to enter
ga: Teacht go hÉirinn agus cead isteach

source: There are some general rules which apply regardless of the reason why you are coming to Ireland
ga: Tá roinnt rialacha ginearálta i bhfeidhm gan aird ar an gcúis atá agat teacht go hÉirinn

source: EEA and Switzerland: In general, nationals of EEA countries or Switzerland, have the right to enter Ireland (subject to some narrow restrictions)
ga: AE/LEE/An Eilvéis: Go ginearálta, tá cead isteach go hÉirinn ag náisiúnaigh de bhallstáit an AE, de thíortha eile an LEE nó ón Eilvéis, (faoi réir roinnt srianta cúnga)

source: You do not need a visa but you will need a valid passport or identity card in order to land
ga: Níl víosa ag teastáil uait ach beidh pas nó cárta aitheantais bailí ag teastáil uait le teacht isteach

source: You are generally entitled to take up residence in Ireland if you are employed or self-employed
ga: Go ginearálta, tá tú i dteideal cónaí in Éirinn má tá tú fostaithe nó féinfhostaithe

source: You are entitled to come here to study or retire here if you meet certain conditions
ga: Tá tú i dteideal teacht anseo le staidéar a dhéanamh nó le dul ar scor anseo má chomhlíonann tú coinníollacha áirithe

source: Other countries: Nationals of other countries need permission to enter in Ireland and require permission to remain here
ga: Tíortha eile: Tá cead isteach go hÉirinn agus cead chun fanacht anseo ag teastáil ó náisiúnaigh de thíortha eile

source: (This doesn't apply if you are a family member of an EEA or a Swiss national who is exercising the right of free movement
ga: (Ní bhaineann seo más duine muinteartha thú de náisiúnach ón AE/LEE/Eilvéis atá ag cleachtadh cheart na saorghluaiseachta

source: You must however get a residence card.)
ga: Ní mór duit cárta cónaithe a fháil áfach.)

source: Coming to Ireland to work
ga: Teacht go hÉirinn le dul ag obair

source: Your right to work as an employee, to be self-employed or set up a business in Ireland depends on your nationality and a number of other factors
ga: Braitheann do cheart chun oibre mar fhostaí, do cheart a bheith féinfhostaithe nó do cheart gnólacht a bhunú in Éirinn ar do náisiúntacht agus ar roinnt tosca eile

source: You can find out about jobs in Ireland from a number of sources
ga: Is féidir leat eolas a fháil ar phoist in Éirinn ó roinnt foinsí

source: If you are starting work you will need information on issues such as tax and social insurance contributions
ga: Má tá tú ag tosú ar obair beidh eolas ag teastáil uait ar chúrsaí cánach agus ranníocaíochtaí árachais shóisialaigh

source: EEA and Swiss nationals have the right to live, work or set up a business in Ireland
ga: Tá sé de chead ag náisiúnaigh ón AE/LEE/Eilvéis cónaí, obair nó gnólacht a bhunú in Éirinn

source: You do not need an employment permit
ga: Níl cead fostaíochta ag teastáil uait

source: You are entitled to be treated in the same way as Irish workers
ga: Tá tú i dteideal go gcaitear leat ar an gcaoi chéanna le hoibrithe ó Éirinn

source: You are entitled to have family members come with you to Ireland
ga: Tá baill do theaghlaigh i dteideal teacht go hÉirinn leat

source: Other countries: If you are from outside the EEA or Switzerland you may need a visa in order to come here
ga: Tíortha eile: Murar as an AE/LEE nó an Eilvéis thú, d'fhéadfadh go mbeadh víosa ag teastáil uait le teacht anseo

source: You need an employment permit in order to work or permission to set up a business here
ga: Tá cead fostaíochta ag teastáil uait le dul ag obair nó cead chun gnólacht a bhunú anseo

source: You can find out about the different types of employment permit if you are coming to work in Ireland
ga: Is féidir leat eolas a fháil ar na cineálacha éagsúla de cheadanna fostaíochta má tá tú ag teacht le dul ag obair in Éirinn

source: Your entitlement to have family members come to join you in Ireland depends on the type of employment permit you have
ga: Tá do theidlíocht i dtaobh bhaill do theaghlaigh ag teacht go hÉirinn le bheith leat ag brath ar an gcineál cead fostaíochta atá agat

source: Coming to Ireland to study
ga: Teacht go hÉirinn le dul ag staidéar

source: If you intend to come to Ireland to study, you must get a place in an Irish educational institution
ga: Má tá sé i gceist agat teacht go hÉirinn le dul ag staidéar, ní mór duit áit a fháil in institiúid oideachais in Éirinn

source: There is further information on the education system at primary, secondary and third level
ga: Tá tuilleadh eolais le fáil anseo ar an gcóras oideachais ag leibhéal na bunscoile, na meánscoile agus ag an tríú leibhéal

source: If you are moving to Ireland for third-level education you can find out about the allocation of third-level places. You can read more about immigrations rules for full-time non-EEA students
ga: Má tá tú ag teacht go hÉirinn le haghaidh oideachais tríú leibhéal is féidir leat eolas a fháil maidir le leithdháileadh na n-áiteanna tríú leibhéal

source: In general, universities and other third-level colleges charge higher fees to students from outside the EEA and Switzerland
ga: Go ginearálta, gearrann ollscoileanna agus coláistí tríú leibhéal eile táillí níos airde ar mhic léinn nach as an LEE nó an Eilvéis dóibh

source: Coming to Ireland to retire
ga: Teacht go hÉirinn le dul ar scor

source: You can find out general information on in our document about retiring to Ireland
ga: Is féidir leat eolas ginearálta a fháil ar theacht ar scor go hÉirinn

source: Coming to Ireland to seek international protection
ga: Teacht go hÉirinn chun cosaint a lorg

source: Seeking protection generally means applying for refugee status or subsidiary protection but, if you are refused this, you may apply for permission to remain
ga: Is éard is ciall le cosaint a lorg go hiondúil ná cur isteach ar stádas dídeanaithe ach, má dhiúltaítear dó seo, is féidir leat cur isteach ar chead chun fanacht

source: EEA nationals are not entitled to seek protection in Ireland
ga: Níl náisiúnaigh ón AE i dteideal cosaint a lorg in Éirinn

source: If you are seeking protection you must be allowed to land in Ireland
ga: Má tá cosaint á lorg agat caithfidh go ligfear isteach go hÉirinn thú

source: You can find out more about the asylum process and the services available to asylum seekers
ga: Is féidir leat tuilleadh eolais a fháil ar an bpróiseas tearmainn agus ar na seirbhísí atá ar fáil don lucht iarrtha tearmainn

source: You may be a Programme refugee
ga: D'fhéadfaí go mbeifeá i do dhídeanaí cláir

source: This means that you come to Ireland as part of an organised group and have refugee status
ga: Is éard is ciall leis seo ná gur tháinig tú go hÉirinn mar chuid de ghrúpa eagraithe agus go gcaitear leat mar dhídeanaí

source: You do not have to go through the normal applications process and you are entitled to work once you arrive in Ireland
ga: Ní bhíonn ort dul tríd an ngnáthphróiseas iarratais agus bíonn tú i dteideal dul ag obair chomh luath is a thagann tú go hÉirinn

source: General information about living in Ireland
ga: Eolas ginearálta maidir le cónaí in Éirinn

source: Government: Ireland is a parliamentary democracy
ga: Rialtas: Is daonlathas parlaiminteach atá i bhfeidhm in Éirinn

source: All residents have the right to vote in local elections and EU citizens also have the right to vote in European elections
ga: Tá cead vótála i dtoghcháin áitiúla ag gach cónaitheoir, agus ina theannta sin tá cead vótála i dtoghcháin Eorpacha ag saoránaigh den AE

source: UK citizens have the right to vote in national elections as well
ga: Tá cead vótála i dtoghcháin náisiúnta ag saoránaigh den Ríocht Aontaithe freisin

source: You can find out further information about the national government and local government
ga: Is féidir leat tuilleadh eolais a fháil ar Rialtas náisiúnta na hÉireann agus ar rialtas áitiúil

source: Tax and social insurance contributions: If you are working or self-employed you are obliged to pay PRSI contributions in the same way as Irish people
ga: Cáin agus ranníocaíochtaí árachais shóisialaigh: Má tá tú ag obair nó féinfhostaithe, ní mór duit ranníocaíochtaí ÁSPC a íoc mar a dhéanann Éireannaigh

source: If you are resident in Ireland, you may be liable for income tax and for capital taxes
ga: Go ginearálta, má tá tú i do chónaí in Éirinn, d'fhéadfá a bheith faoi dhliteanas maidir le cáin ioncaim agus le cánacha caipitil

source: There are specific rules about residency for tax purposes
ga: Tá rialacha sainiúla ann maidir le cónaitheacht i dtaobh cúinsí cánach

source: Education: Free primary education and secondary education is available to all children aged under 18 legally resident in Ireland
ga: Oideachas: Tá bunoideachas agus meánoideachas saor in aisce ar fáil do gach páiste (faoi bhun 18 mbliana d'aois) atá ina chónaí do dlíthiúil in Éirinn

source: There are also some fee-paying primary and secondary schools available
ga: Tá roinnt bunscoileanna agus meánscoileanna táille ann freisin

source: School attendance is obligatory until the age 16
ga: Tá freastal ar an scoil riachtanach go dtí 16 bliana d'aois

source: Equality: Ireland has equality legislation that prohibits discrimination in employment and access to services on a number of grounds including nationality and racial origin
ga: Comhionannas: Tá reachtaíocht chomhionannais i bhfeidhm in Éirinn a chuireann cosc ar leithcheal i bhfostaíocht agus i rochtain ar sheirbhísí ar fhorais éagsúla lena n-áirítear náisiúntacht agus bunadh cine

source: Housing: You are likely to find that housing is expensive
ga: Tithíocht: Is dóigh go gceapfaidh tú go bhfuil tithíocht costasach

source: Some people live in owner-occupied private housing while a number live in private rented accommodation
ga: Tá an chuid is mó de dhaoine ina gcónaí i dtithíocht phríobháideach úinéir-áitithe agus tá go leor daoine ina gcónaí i gcóiríocht phríobháideach ar cíos

source: Social housing is available but you generally need to have been resident in Ireland for a period of time before you become eligible for it
ga: Tá tithíocht shóisialta inacmhainne ar fáil ach go hiondúil ní mór duit a bheith i do chónaí in Éirinn ar feadh tréimhse sula mbeidh tú incháilithe lena haghaidh

source: Health services: If you are ordinarily resident in Ireland, you may be entitled to a range of health services that are either free of charge or subsidised by the Government
ga: Seirbhísí sláinte: Má tá tú i do ghnáthchónaí in Éirinn, d'fhéadfaí go mbeifeá i dteideal réimse de sheirbhísí sláinte atá saor in aisce nó atá fóirdheonaithe ag an Rialtas

source: There is also a range of private health care services
ga: Tá réimse de sheirbhísí príobháideacha cúraim sláinte ann freisin

source: Your permission to stay in Ireland may include a requirement that you have private health insurance
ga: D'fhéadfaí go mbeadh sé riachtanach árachas sláinte príobháideach a bheith agat mar chuid den chead atá agat fanacht in Éirinn

source: Social security entitlements: If you are moving to Ireland you need to know about your social security entitlements
ga: Teidlíochtaí slándála sóisialaí: Má tá tú ag teacht go hÉirinn, ní mór duit a bheith ar an eolas maidir le do theidlíochtaí slándála sóisialaí

source: EEA and Swiss nationals come under the general rules on social security for migrant workers
ga: Clúdaítear náisiúnaigh an AE/LEE agus na hEilvéise faoi na rialacha ginearálta maidir le slándáil shóisialaigh d'oibrithe imirceacha

source: This means that you may receive certain benefits from your home country while you are in Ireland and you may combine social insurance contributions paid in 2 or more countries to help you qualify for benefits
ga: I measc nithe eile, ciallaíonn seo go mb'fhéidir go bhfaighfeá sochair áirithe ó do thír dhúchais nuair a bheidh tú in Éirinn, agus is féidir leat ranníocaíochtaí árachais shóisialaigh a n-íoctar iad in dhá thír nó níos mó a chur le chéile chun cabhrú leat a bheith incháilithe ar shochair

source: You are also entitled to the same social and tax advantages as Irish citizens
ga: Ina theannta sin, tá tú i dteideal na mbuntáistí sóisialta agus cánach céanna is atá ag saoránaigh na hÉireann

source: There are bilateral social security arrangements with a small number of other countries
ga: Tá comhaontuithe déthaobhacha maidir le slándáil shóisialta ann le líon beag de thíortha eile

source: These generally allow contributions in the other countries to be combined with your Irish contributions to enable you to qualify for benefits
ga: Go hiondúil, ceadaíonn siad ranníocaíochtaí sna tíortha eile a chur le chéile le do ranníocaíochtaí in Éirinn le cur ar do chumas a bheith incháilithe ar shochair

source: Social assistance payments: Everyone, including Irish citizens, has to meet the habitual residence requirement if applying for a social assistance payment
ga: Íocaíochtaí cúnaimh shóisialaigh: Ní mór do gach duine, saoránaigh na hÉireann san áireamh, an riachtanas maidir le gnáthchónaí a chomhlíonadh má tá siad ag cur isteach ar íocaíocht chúnaimh shóisialaigh

source: Changing your name: A foreign national aged 18 or over must get a change of name licence from the Irish Naturalisation and Immigration Service (INIS) before executing a deed poll
ga: D'ainm a athrú: Caithfidh náisiúnach coigríche de 18 bliana d'aois nó os a chionn ceadúnas um athrú ainm ó Sheirbhís Eadóirseachta agus Inimirce na hÉireann (INIS) sula gcuireann sé gníomhas aonpháirtí i bhfeidhm

source: A British citizen does not require a change of name licence but is likely to need a letter to that effect from INIS
ga: Ní theastaíonn ceadúnas um athrú ainm ó shaoránach na Breataine, ach is dóigh go dteastóidh litir ó INIS uaidh chun é sin a dhearbhú

source: Pets: There are regulations about importing pets from abroad, so you need find out about the procedures for bringing your pet to Ireland
ga: Peataí: Tá rialacháin ann maidir le peataí a thabhairt isteach anseo ó thír eile, mar sin ní mór duit a bheith ar an eolas faoi na nósanna imeachta chun do pheata a thabhairt go hÉirinn

source: Customs: There are customs regulations about the importation of prohibited or restricted goods and Customs and Excise officers have the power to carry out searches of the baggage of people travelling to Ireland
ga: Custaim: Tá rialacháin chustaim ann maidir le hearraí coiscthe nó srianta a allmhairiú agus tá sé de chumhacht ag oifigigh Chustaim agus Mháil bagáiste daoine atá ag taisteal go hÉirinn a chuardach

source: Driving, cars and transport: Full driving licences from all other EU member states (and some other countries) are recognised for use in Ireland
ga: Tiomáint, carranna agus iompar: Aithnítear ceadúnais tiomána iomlána ó gach stát eile san AE (agus ó roinnt tíortha eile) le húsáid in Éirinn

source: You should find out if you need to convert your driving licence to an Irish one
ga: Ba cheart duit a fháil amach an mbeidh ort do cheadúnas tiomána a mhalartú ar son ceadúnais tiomána Éireannaigh

source: If you want to bring your car to Ireland you need to know about importing a car and implications for Vehicle Registration Tax (VRT)
ga: Más mian leat do charr a thabhairt go hÉireann, ní mór duit a bheith ar an eolas faoi charr a iompórtáil agus faoi na himpleachtaí maidir le Cáin Chláraithe Feithicle (CCF)

source: You can get further information from your nearest Irish embassy or consulate or the embassy or consulate of your country in Ireland
ga: Is féidir leat tuilleadh eolais a fháil ón ambasáid nó ón gconsalacht Éireannach is cóngaraí nó ó ambasáid nó ó chonsalacht do thíre in Éirinn
